const settings = require('./settings.json');

module.exports = (NumeroDoDono, NomeDoDono, NomeDoBot, prefix) => {
  const menu = `┏╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┓
┃         ⁞֟፝⁞ 𝐈𝐧𝐟𝐨 𝐁𝐨𝐭/𝐃𝐨𝐧𝐨 ⁞֟፝⁞       
┣╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛
┃֪࣪┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃֪࣪ 𝆺᮫𝅥 ͜🩵 𝐁𝐨𝐭: 『 ${settings.NomeDoBot} 』
┃֪࣪ 𝆺᮫𝅥 ͜🩵 𝐃𝐨𝐧𝐨: 『 ${settings.NomeDoDono} 』
┃֪࣪ 𝆺᮫𝅥 ͜🩵 𝐏𝐫𝐞𝐟𝐢𝐱𝐨: 『 ${settings.prefix} 』
┃֪࣪└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┗╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛
╭━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╮
┃ ➪ 『 ✰ۣۜۜ͜͡𝐏𝐫𝐢𝐧𝐜𝐢𝐩𝐚𝐥 』
╰━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╯
┏╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┓
┃┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Criador
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Bug
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Gerarlink
┃└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃
╭━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╮
┃ ➪ 『 ✰ۣۜۜ͜͡𝐀𝐝𝐦𝐬 』
╰━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╯
┃                       
┃┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Ban
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}D
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Totag
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Cita
┃└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┗╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛
╭━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╮
┃ ➪ 『 ✰ۣۜۜ͜͡𝐃𝐨𝐧𝐨 』
╰━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╯
┃
┃┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Limparqr
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Bangp
┃└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┗╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛
╭━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╮
┃ ➪ 『 ✰ۣۜۜ͜͡𝐑𝐩𝐠 』
╰━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╯
┃
┃┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Perfilrpg
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Minerar
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Pvp
┃└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┗╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛
╭━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╮
┃ ➪ 『 ✰ۣۜۜ͜͡𝐙𝐮𝐞𝐢𝐫𝐚𝐬 』
╰━°𖠁°✮•| ꒰ ❃ ꒱ |•✮°𖠁°━╯
┃
┃┌┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┃╎ 𝆺᮫𝅥 ͜🩵${settings.prefix}Comer
┃└┈ׁ┈─═─┈ׁ┈⃘ׁ ⊹
┗╾═╼࡙ᷓ✿࡙╾ᷓ═╼֡͜❀⃘໋֢֓🩵⃘໋ᩚ᳕֢֓❀֡͜╾═╼࡙ᷓ✿࡙╾ᷓ═╼┛`;
  return menu;
};